mejorando el UML
